microdynamics-robot-quadcopter/breeze_firmware_none/System/System_IMU/stm32f10x_system_imu.c
#include "stm32f10x_system_imu.h"
#include "stm32f10x_system_mpu6050.h"
#include "stm32f10x_algorithm_filter.h"
#include "stm32f10x_it.h"
#include "math.h"

imu_t imu = {0};
uint8_t imuCaliFlag = 0;

void IMU_Init(void)
{
    imu.ready    = 0;  /*需要先校准陀螺*/
    imu.caliPass = 1;
    LPF2pSetCutOffFreq_1(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
    LPF2pSetCutOffFreq_2(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
    LPF2pSetCutOffFreq_3(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
    LPF2pSetCutOffFreq_4(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
    LPF2pSetCutOffFreq_5(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
    LPF2pSetCutOffFreq_6(IMU_SAMPLE_RATE, IMU_FILTER_CUTOFF_FREQ);
}

/*should place to a level surface and keep it stop for 1~2 second*/
/*return 1 when finish*/
uint8_t IMU_Calibrate(void)  /*检测时间为3s*/
{
    static float AccSum[3]     = {0, 0, 0};
    static float GyroSum[3]    = {0, 0, 0};
    static uint16_t cnt        = 0;
    static uint16_t PreTime    = 0;
    static uint8_t calibrating = 0;
    uint8_t ret                = 0;
    uint8_t i                  = 0;
    uint16_t dt                = 0;
    uint16_t NowTime           = 0;

    NowTime = millis();
    dt = NowTime - PreTime;
    
    if (!calibrating)
    {
        calibrating = 1;
        for (i = 0; i < 3; i++)
        {
            cnt        = 0;
            imu.ready  = 0;
            AccSum[i]  = 0;
            GyroSum[i] = 0;
        }
    }
    
    if (dt >= 10)
    {
        if (cnt < 300)
        {
            for (i = 0; i < 3; i++)
            {
                AccSum[i]  += imu.accRaw[i];
                GyroSum[i] += imu.gyroRaw[i];
            }
            cnt++;
            PreTime = NowTime;
        }
        else
        {
            for (i = 0; i < 3; i++)
            {
                imu.accOffset[i]  = AccSum[i] / (float) cnt;
                imu.gyroOffset[i] = GyroSum[i] / (float) cnt;
            }
            imu.accOffset[2] -= CONSTANTS_ONE_G;
            calibrating = 0;
            ret = 1;
        }
    }
    
    return ret;
    
}

#define SENSOR_MAX_G 8.0f
#define SENSOR_MAX_W 2000.0f
#define ACC_SCALE (SENSOR_MAX_G / 32768.0f)
#define GYRO_SCALE (SENSOR_MAX_W / 32768.0f)

void IMU_ReadSensorHandle(void)
{
    uint8_t i;
    MPU6050_ReadAcc(imu.accADC);
    MPU6050_ReadGyro(imu.gyroADC);
    
    for (i = 0; i < 3; i++)
    {
        imu.accRaw[i] = (float) imu.accADC[i] * ACC_SCALE * CONSTANTS_ONE_G;
        imu.gyroRaw[i] = (float) imu.gyroADC[i] * GYRO_SCALE * M_PI_F / 180.0f;
    }
    
    imu.accb[0] = LPF2pApply_1(imu.accRaw[0]);
    imu.accb[1] = LPF2pApply_2(imu.accRaw[1]);
    imu.accb[2] = LPF2pApply_3(imu.accRaw[2]);
    imu.gyro[0] = LPF2pApply_4(imu.gyroRaw[0]);
    imu.gyro[1] = LPF2pApply_5(imu.gyroRaw[1]);
    imu.gyro[2] = LPF2pApply_6(imu.gyroRaw[2]);
}

#define ACCZ_ERR_MAX 0.05
#define CHECK_CNT    5

uint8_t IMU_Check(void)
{
    uint32_t AccZSum = 0;
    float AccZb      = 0;
    
    uint8_t i;
    for (i = 0; i < CHECK_CNT; i++)
    {
        MPU6050_ReadAcc(imu.accADC);
        AccZSum += imu.accADC[2];
    }
    imu.accRaw[2] = (float) (AccZSum / (float) CHECK_CNT) * ACC_SCALE * CONSTANTS_ONE_G;
    AccZb = imu.accRaw[2] - imu.accOffset[2];

    if ((AccZb > CONSTANTS_ONE_G - ACCZ_ERR_MAX) && (AccZb < CONSTANTS_ONE_G + ACCZ_ERR_MAX))
    {
        imu.caliPass = 1;
    }
    else
    {
        imu.caliPass = 0;
    }
    return imu.caliPass;
}

/*
in standard sequence , roll-pitch-yaw , x-y-z
angle in rad
get DCM for ground to body
*/
static void EularToDCM(float DCM[3][3], float pitch, float yaw, float roll)
{
    float cosx, cosy, cosz, sinx, siny, sinz;
    float coszcosx, coszcosy, sinzcosx, coszsinx, sinzsinx;

    cosx = cosf(roll * M_PI_F / 180.0f);
    sinx = sinf(roll * M_PI_F / 1800.0f);
    cosy = cosf(pitch * M_PI_F / 180.0f);
    siny = sinf(pitch * M_PI_F / 180.0f);
    cosz = cosf(yaw * M_PI_F / 180.0f);
    sinz = sinf(yaw * M_PI_F / 180.0f);
    
    coszcosx = cosz * cosx;
    coszcosy = cosz * cosy;
    sinzcosx = sinz * cosx;
    coszsinx = cosz * sinx;
    sinzsinx = sinz * sinx;
    
    DCM[0][0] = coszcosy;
    DCM[0][1] = cosy * sinz;
    DCM[0][2] = -siny;
    DCM[1][0] = -sinzcosx + (coszsinx * siny);
    DCM[1][1] = coszcosx + (sinzsinx * siny);
    DCM[1][2] = sinx * cosy;
    DCM[2][0] = (sinzsinx) + (coszcosx * siny);
    DCM[2][1] = -(coszsinx) + (sinzcosx * siny);
    DCM[2][2] = cosy * cosx;
}
